<%@ page language="java" contentType="text/html; charset=EUC-KR"
    pageEncoding="EUC-KR"%>
<%
	// if 조건문과 for 반복문 연습
	
	// 변수 선언 및 초기화 
	int i = 0;
	int sum = 0;
	
	/*  1.  산술연산자를 사용하여 구현하라. 
	1번부터 100번까지의 학생이 있다. 1번부터 10번까지, 11번부터 20번까지,....10명씩 한팀이고 각팀이 1번, 11번, 21번이 팀장이다.  
	한 학생의 번호를 이용하여 그 팀의 팀장번호를 구하는 프로그램을 구현하라.
	(ex : 8번 학생의 팀장번호는 1번, 15번 학생의 팀장번호는 11번이 된다) */
	
	// 2. if~else문을 사용하여 홀짝수를 구별하는 프로그램을 구현하라.
	
	// 3. if~else if~else문을 사용하여 양수, 음수, 0 을 구별하는 프로그램을 구현하라.
	
	/* 4. 20대만 출입이 가능한 곳이 있다. 두 명의 나이가 모두 20대이면 출입, 아니면 출입금지를 출력하는 프로그램을 구현하라.
	(if~else, 산술연산자, 논리연산자 사용) */
	
	// 5. 1~50까지의 수에서 5의배수만 출력하는 프로그램을 구현하라.(for, if, %연산자 사용)
	
	// 6. 1~10까지의 수에서 홀수의 합을 출력하는 프로그램을 구현하라.(for, if, %연산자 사용)
	
	/* 	7.  for, if문등을 사용하여 2014년에서 2500년 사이의 윤년을 출력하는 프로그램을 구현하라.
	다음의 경우가 윤년이다.
	① 400로 나누어 떨어지는 해
	② 4로 나누어 떨어지지만 100으로는 나누어 떨어지지 않는 해 */
	
	/* 8. for, if문등을 사용하여 소수(1제외)를 판별하는 프로그램을 구현하라.
	(소수란 1과 자기 자신만으로 나누어 떨어지는 1보다 큰 양의 정수. 
	이를테면, 2, 3, 5, 7, 11, 13, 17, 19, 23, 29, 31,… 등은 모두 소수이다) */
	
	// 9. 3~100까지의 수에서 소수의 갯수를 출력하는 프로그램을 구현하라.
	
	// 10. 이중 for문을 사용하여 다음과 같이 출력하는 프로그램을 구현하라.
	
	// 11. 다음과 같은 출력 결과물(가로 구구단)이 나오도록 구현하라.
	
	// 12. 다음과 같은 출력 결과물(세로 구구단)이 나오도록 구현하라.
	
	
	
%>
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>if 조건문과 for 반복문 연습</title>
</head>
<body>
	
</body>
</html>